benchmark-results/round-1/8t 24c/redis.txt
threads=8
connections=24

memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 500000 --ratio=1:0 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port
memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 500000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port --key-pattern G:G
memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 50000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 -p $port --key-pattern G:G
memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 500000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 --pipeline=8  -p $port --key-pattern R:R
memtier_benchmark -s localhost -t $threads -c $connections -d 20 -n 50000 --ratio=1:10 --key-minimum=1 --key-maximum=100000000 --hide-histogram --print-percentiles=50,80,90,99,99.9,99.99,99.995,99.999,100 -p $port --key-pattern R:R
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  78 secs]  0 threads:    96000000 ops, 1192874 (avg: 1216049) ops/sec, 77.23MB/sec (avg: 78.73MB/sec),  1.29 (avg:  1.26) msec latency

8         Threads
24        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      1215179.60          ---          ---         1.26166         1.23100         1.50300         1.66300         2.19100         3.80700         7.29500         8.57500         9.66300        11.64700     80563.81
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    1215179.60         0.00         0.00         1.26166         1.23100         1.50300         1.66300         2.19100         3.80700         7.29500         8.57500         9.66300        11.64700     80563.81
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  73 secs]  0 threads:    96000000 ops, 1295331 (avg: 1311493) ops/sec, 53.82MB/sec (avg: 54.48MB/sec),  1.18 (avg:  1.17) msec latency

8         Threads
24        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       119138.53          ---          ---         1.16969         1.13500         1.39900         1.55900         2.06300         2.87900         5.18300         6.14300         7.07100         8.57500      7910.82
Gets      1191372.22      6502.75   1184869.47         1.16962         1.13500         1.39900         1.55900         2.06300         2.87900         5.21500         6.14300         7.10300         8.57500     47832.64
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    1310510.75      6502.75   1184869.47         1.16962         1.13500         1.39900         1.55900         2.06300         2.87900         5.21500         6.14300         7.10300         8.57500     55743.46
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  41 secs]  0 threads:     9600000 ops,  233204 (avg:  230857) ops/sec, 9.69MB/sec (avg: 9.59MB/sec),  0.82 (avg:  0.83) msec latency

8         Threads
24        Connections per thread
50000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        20999.70          ---          ---         0.83208         0.82300         0.93500         1.01500         1.66300         2.09500         3.66300         4.15900         6.04700         6.81500      1394.36
Gets       209969.26      1251.85    208717.41         0.83147         0.82300         0.93500         1.01500         1.65500         2.09500         3.66300         4.22300         5.91900         7.77500      8432.28
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     230968.96      1251.85    208717.41         0.83153         0.82300         0.93500         1.01500         1.65500         2.09500         3.66300         4.22300         5.91900         7.77500      9826.64
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  75 secs]  0 threads:    96000000 ops, 1225514 (avg: 1272563) ops/sec, 74.03MB/sec (avg: 76.87MB/sec),  1.25 (avg:  1.20) msec latency

8         Threads
24        Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       115630.22          ---          ---         1.20553         1.17500         1.43900         1.60700         2.12700         2.87900         4.95900         5.98300         7.07100         8.31900      7666.05
Gets      1156289.49   1156289.49         0.00         1.20542         1.17500         1.43900         1.60700         2.12700         2.86300         4.92700         5.95100         7.07100         8.38300     71013.56
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals    1271919.71   1156289.49         0.00         1.20543         1.17500         1.43900         1.60700         2.12700         2.86300         4.92700         5.95100         7.07100         8.38300     78679.61
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  41 secs]  0 threads:     9600000 ops,  228242 (avg:  233506) ops/sec, 13.79MB/sec (avg: 14.11MB/sec),  0.84 (avg:  0.82) msec latency

8         Threads
24        Connections per thread
50000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        21205.49          ---          ---         0.82242         0.80700         0.92700         0.99900         1.63900         2.04700         4.06300         4.99100         6.11100         6.75100      1405.83
Gets       212026.88    212026.88         0.00         0.82204         0.80700         0.92700         0.99900         1.63900         2.03900         4.09500         5.11900         6.07900         7.61500     13021.81
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          ---
Totals     233232.37    212026.88         0.00         0.82208         0.80700         0.92700         0.99900         1.63900         2.03900         4.09500         5.11900         6.07900         7.61500     14427.64